var Bmob = require('../../utils/title.js');
//获取应用实例
var app = getApp()


Page({
  data: {
    express:[
      {
        date:"2022-06-23",
        place:"零风",
        version:'v1.2.1',
        state:"【功能调整】\n"+
        "(1)、重新展示底部导航。\n"+
        "(2)、取消关闭弹窗提示。\n"+
        "(3)、取消详情预览。\n" +
        "(4)、新增最新下载栏目。\n"+
        "(5)、右上角分享配置。\n"+
        "(6)、提升广告加载时间。\n"+
        "(7)、处理下载按钮加载慢的问题。\n"
      },{
        date:"2022-06-20 13:01",
        place:"零风",
        version:'v1.2.0',
        state:"【功能调整】\n"+
        "(1)、解决播放广告重复下载的问题。\n"+
        "(2)、解决外链图片无法下载的问题。\n"+
        "(3)、封装下载接口给客户端统一下载。\n"+
        "(4)、设置全局广告函数。\n"+
        "(5)、更换导航图标。\n"+
        "(6)、使用应用ID作为存放目录！\n" +
        "(7)、首页导航菜单-自由定义。\n"+
        "(8)、调整搜索框搜索文字！\n"+
        "(9)、隐藏底部导航！\n"+
        "(10)、更换下载弹窗提示！\n"+
        "(11)、增加第三方广告！\n"
      },{
        date:"2022-0615 11:01",
        place:"零风",
        version:'v1.1.9',
        state:"【功能调整】\n"+
        "(1)、去掉底部自定义导航，新增静态导航格式。\n"+
        "(2)、去掉详情页自定义头部导航。\n"+
        "(3)、更换域名、更换服务器。\n"
      },{
        date:"2022-05-29 18:41",
        place:"零风",
        version:'v1.1.8',
        state:"【功能调整】\n"+
        "(1)、动态展示首页分类。\n"+
        "(2)、分类菜单去除分类ID识别。\n"+
        "(3)、广告开启开关新增数量5。\n"
      },{
      date:"2022-03-25 11:41",
      place:"零风",
      version:'v1.1.7',
      state:"【功能调整】\n"+
      "(1)、调整了首页、列表页大图广告，当广告加载失败则展示图片。\n"+
      "(2)、解决主题色RGB格式生效的问题。\n"+
      "(3)、新增广告is open。\n"+
      "(4)、调整banner广告和详情插图广告弹出时间，时间为30~90s。"
    },{
      date:"2022-03-22 15:14",
      place:"零风",
      version:'v1.1.6',
      state:"【新功能】\n"+
      "(1)、首页、列表页新增banner广告，通过随机展示的方式让用户想不到下一秒会在哪一个位置出现。增加了趣味性，让广告不再变得乏味。\n"+
      "(2)、图片列表详情根据业务内容不同，通过计算提供不同的方法。你可以试试点击表情包进入详情后再点击头像进入详情。\n"+
      "(3)、新增主题主体颜色:rgb(60, 137, 253)【由杨磊提供】\n"+
      "(4)、主页详情新增插屏广告。" 
    },{
      date:"2022-03-21 15:51",
      place:"零风",
      version:'v1.1.5',
      state:"【功能调整】\n"+ 
            "(1)、首页布局调整，取消下滑加载更多，只展示24张图片。\n"+
            "(2)、首页高度、宽度、左右布局调整。\n"+
            "(3)、首页状态栏颜色：blue。\n"+
            "(4)、首页详情全屏展示，动态获取高度，异常状态栏。\n"+
            "(5)、首页图标更改。\n"+
            "(6)、首页搜索匡默认值更改。\n"+
            "(7)、首页壁纸默认展示唯美壁纸栏目,通过app.js动态配置。\n"+
            "【bug修复】\n"+ 
            "比如有人点击表情包“搞笑”栏目的表情包，这相关推荐就推荐匹配搞笑的相应栏目，其他栏目也是。头像一样。"
    },{
      date:"2022-03-16 12:00",
      place:"零风",
      version:'v1.1.4',
      state:"【功能调整】\n"+ 
            "(1)、更新日志加入更新类别！\n" +
            "(2)、首页只展示壁纸分类图片列表！\n"+
            "(3)、图片详情大小、尺寸调整。\n"+
            "(4)、删除分类、日志导航菜单栏。\n"+
            "(5)、首页搜索默认值改为：搜索壁纸。\n"+
            "(6)、把加载更多更改为加载完毕！【用户交互优化】\n "+
            "(7)、分类列表详情页如果分类只有一个，那么就自动隐藏分类导航菜单栏！【用户视觉优化】\n"+
            "(8)、首页点击壁纸跳转到壁纸详情。\n"+
            "(9)、首页关闭长按下载\n"+
            "【bug修复】\n"+ 
            "(1)、修复首页和分类详情图片列表无限重复加载bug!\n"+
            "(2)、解决没有开通流量主没有广告ID的问题。\n"+
            "【新功能】\n"+
            "(1)、首页底部新增导航分类菜单。\n"+
            "(2)、新增壁纸详情页。\n"+
            "(3)、新增壁纸详情页新增:下载、分享、返回。\n"+
            "(4)、当首页搜索框输入logs、日志、查看logs、更新内容时，就会跳转到更新日志页面。"
    },{
      date:"2022-03-08 16:40",
      place:"零风",
      version:'v1.1.3',
      state:"1、解决了详情页下载失败的问题！\n " +
            "2、详情页下载播放广告之后提示正在保存！[用户交互优化]"  
    },{
        date:"2022-03-08 15:23",
        place:"零风",
        version:'v1.1.2',
        state:"1、首页新增函数读取分类ID集合查询。\n " +
              "2、首页分类导航菜单动态载入。\n"  +
              "3、解决分类超过3个之后的布局问题。\n"+
              "4、解决分类字段更换之后分类详情无内容问题。\n"+
              "5、首页新增点击图片提示进入详情？\n"+
              "6、新增图片详情页!\n"+
              "7、详情页新增预览、分享给朋友、下载功能！\n"+
              "8、详情页下载之前提示播放广告！\n"+
              "9、详情页列表点击图片切换当前图片详情！"
    },{
        date:"2022-03-08 09:50",
        place:"零风",
        version:'v1.1.1',
        state:"1、解决了分类页查询全部的bug。\n " +
              "2、首页轮播广告设置为循环播放。\n"  +
              "3、如果广告调用失败，则直接给予奖励！"
    },{
        date:"2022-03-07 15:37",
        place:"零风",
        version:'v1.1.0',
        state:"1、首页图片列表格式调整。\n " +
              "2、分类子页面图片列表页调整。\n"  +
              "3、首页搜索按钮适应性调整。\n"+
              "4、首页新增分类导航菜单。\n"+
              "5、动态展示分类子菜单和内容。\n"+
              "6、添加分类栏目。\n"+
              "7、动态控制图片列表高度布局。\n"+
              "8、新增查询全部分类函数。、\n"+
              "9、解决首页广告接入失败问题！\n"+
              "10、首页广告改为长按3秒播放广告后自动保存，如果未观看完，则提示无法获得奖励。"
    },{
        date:"2022-02-28 12:01",
        place:"零风",
        version:'v1.0.9',
        state:"1、新增分类详情空内容文字。\n " +
              "2、调整了分类详情页页面高度。\n"  +
              "3、解决日志记录未换行。\n"+
              "4、新增广告元素！\n"+
              "5、首页长按保存图片更改为看完广告后自动保存。"
    },{
        date:"2022-02-25 11:50",
        place:"零风",
        version:'v1.0.8',
        state:"1、主页动态载入图片列表。\n " +
              "2、下拉无限动态加载图片。\n"  +
              "3、分类详情新增分类子菜单。\n"+
              "4、点击分类子菜单可以切换分类图片。\n"+
              "5、实现了动态添加分类菜单。\n"+
              "6、实现了首页搜索功能！可输入关键字搜索，比如: 图片名称、图片ID、上级ID等"
    },{
        date:"2022-02-23 15:27",
        place:"零风",
        version:'v1.0.7',
        state:"1、解决分类栏查看按钮被遮蔽问题。\n " +
              "2、配置更换域名，设置全局。\n" +
              "3、环境分离：本地环境、测试环境！\n" +
              "4、分类栏内容替换。\n" + 
              "5、首页轮播图接入动态数据。"
    },{
        date:"2022-02-15 11:27",
        place:"零风",
        version:'v1.0.6',
        state:"1、解决分类菜单栏分类文字被遮蔽的问题。\n "+
              "2、解决真机环境图片保存失败的问题，未配置图片域名！"
    },{
        date:"2022-02-15 11:05",
        place:"零风",
        version:'v1.0.5',
        state:"1、解决真机环境中保存图片失败的问题。\n "+
              "2、调用用户授权保存图片文件。\n "+
              "3、动态传入图片路径保存！\n "+
              "4、解决更新日志右边按钮字体大小超出内容问题！"
    },{
        date:"2022-02-15 10:38",
        place:"零风",
        version:'v1.0.4',
        state:"1、新增点击图片弹窗。\n "+
              "2、新增长按保存图片文件。\n "+
              "3、保存成功提示！"
    },{
        date:"2022-02-8 12:48",
        place:"零风",
        version:'v1.0.3',
        state:"1、赞赏增加点击事件。\n "+
              "2、新增主页菜单栏。\n "+
              "3、主页新增轮播图、搜索框、图片列表。\n "+
              "4、新增图片弹窗。\n "+
              "5、新增分类菜单栏！"
    },{
        date:"2022-01-20 15:32",
        place:"零风",
        version:'v1.0.2',
        state:"1、加入导航菜单。\n "+
              "2、内容和布局调整。\n "+
              "3、后端框架设计。\n "+
              "4、开放添加图片接口，设立账号。\n "+
              "5、加入更新日志时间轴！"
    },{
      date:"2022-01-18 14:55",
      place:"零风",
      version:'v1.0.1',
      state:"1、接入动态数据。\n "+
            "2、首页添加分类和动态数据，点击首页内容跳转对应的分类列表。\n "+
            "3、新增懒加载图片列表(分页)。"
    },{
      date:"2022-01-14 12:31",
      place:"零风",
      version:'v1.0.0',
      state:"1、小程序配置。\n "+
            "2、填充静态内容。"
    }],
    Number:"813291235464"
  },

  //页面加载
  onLoad: function (options) {
    // 页面初始化 options为页面跳转所带来的参数
    var flag=true;
    var that = this;
    that.setData({
      p_type: options.p_type
    })
    console.log("p_type的值是：", options.p_type)
    Bmob.setPageTitle(options.p_name);

    // 查询所有数据
    if(flag==true){
      wx.showToast({
        title: '正在加载',
        icon: 'loading',
      })
    }
    
  },

  //页面显示 
  onShow:function(){
    //插屏广告
    app.interstitialAd();
  },

  //赞赏
  onCopyNumber:function(){
    tt.showToast({
      title: "感谢赞赏！",
      icon:"success",
      success: (res) => {
        
      },
      fail: (res) => {
        
      },
    });
  },

  //更多
  lower: function () {
    console.log("到达底部");
    var that = this;
    var flag = true;

    // 查询所有数据
    if(flag == true) {
      wx.showToast({
        title: '正在加载',
        icon: 'loading',
      })
    }
  },

  bindPicture: function (res) {
    console.log(res.target.dataset.imgsrc)
    var current = res.target.dataset.imgsrc;
    wx.previewImage({
      current: current,
       urls: this.data.urllist // 需要预览的图片http链接列表
    })
  },

  onReady: function () {
    // 页面渲染完成

  },
  onShow: function () {
    // 页面显示

  },
  onHide: function () {
    // 页面隐藏
  },
  onUnload: function () {
    // 页面关闭
  },
 
})